import 'package:wazaker/models/tables.dart';
import 'package:path/path.dart';
import 'package:sqflite/sqflite.dart';

class DbHelper {
  static final DbHelper _instance = DbHelper.internal();
  factory DbHelper() => _instance;
  DbHelper.internal();
  static Database _db;

  Future<Database> createDatabase() async {
    if (_db != null) {
      return _db;
    }
    //define the path to the database
    String path = join(await getDatabasesPath(), 'mydatabase.db');
    _db = await openDatabase(path, version: 3,
        onCreate: (Database db, int v) async {
      //create all tables
      db.execute(
          "CREATE TABLE azkar(id INTEGER PRIMARY KEY AUTOINCREMENT, category TEXT, content TEXT, after TEXT , pre TEXT, hours INTEGER, totalCount INTEGER,currentCount INTEGER, startDate TEXT,endDate TEXT,fadl TEXT)");
      createrows(db);
    }, onUpgrade: (Database db, int oldV, int newV) {
      if (oldV < newV) {
        db.execute("DROP TABLE IF EXISTS azkar");

        db.execute(
            "CREATE TABLE azkar(id INTEGER PRIMARY KEY AUTOINCREMENT, category TEXT, content TEXT, after TEXT , pre TEXT, hours INTEGER, totalCount INTEGER,currentCount INTEGER, startDate TEXT,endDate TEXT,fadl TEXT)");
        createrows(db);
        //     db.execute('''UPDATE azkar
        // SET category= "السبحه",
        //   content= "سبحان الله",
        //   pre= "",
        //   after= "",
        //   fadl= "",
        //   totalCount= 0,
        //   currentCount= 0
        // WHERE category= "السبحه" and content= "سبحان لله"
        // ''');
      }
    });

    return _db;
  }

  createrows(Database db) async {
    // Azkar Morning

    ///////////////
    ///

    var zekr = Azkar({
      'category': "السبحه",
      'pre': '',
      'content': 'لا إله إلا الله',
      'fav': "",
      'after': "",
      'icon': "",
      'totalCount': 0,
      'currentCount': 0,
      "fadl": 'أفضل الذكر',
    });
    db.insert('azkar', zekr.toMap());

    zekr = Azkar({
      'category': "السبحه",
      'pre': '',
      'content': 'الحمد لله',
      'fav': "",
      'after': "",
      'icon': "",
      'totalCount': 0,
      'currentCount': 0,
      "fadl": 'أفضل الدعاء'
    });
    db.insert('azkar', zekr.toMap());

    zekr = Azkar({
      'category': "السبحه",
      'pre': '',
      'content': 'الله أكبر',
      'fav': "",
      'after': "",
      'icon': "",
      'totalCount': 0,
      'currentCount': 0,
      "fadl": ''
    });
    db.insert('azkar', zekr.toMap());

    zekr = Azkar({
      'category': "السبحه",
      'pre': '',
      'content': 'استغفر الله وأتوب إليه',
      'fav': "",
      'after': "",
      'icon': "",
      'totalCount': 0,
      'currentCount': 0,
      "fadl": ''
    });
    db.insert('azkar', zekr.toMap());

    zekr = Azkar({
      'category': "السبحه",
      'pre': '',
      'content': 'اللهم صلِّ علي سيدنا محمد',
      'fav': "",
      'after': "",
      'icon': "",
      'totalCount': 0,
      'currentCount': 0,
      "fadl": ''
    });
    db.insert('azkar', zekr.toMap());

    zekr = Azkar({
      'category': "السبحه",
      'pre': '',
      'content': 'سبحان الله',
      'fav': "",
      'after': "",
      'icon': "",
      'totalCount': 0,
      'currentCount': 0,
      "fadl": ''
    });
    db.insert('azkar', zekr.toMap());

    zekr = Azkar({
      'category': "السبحه",
      'pre': '',
      'content': 'سبحان الله وبحمده',
      'fav': "",
      'after': "",
      'icon': "",
      'totalCount': 0,
      'currentCount': 0,
      "fadl": ''
    });
    db.insert('azkar', zekr.toMap());

    zekr = Azkar({
      'category': "السبحه",
      'pre': '',
      'content': 'سبحان الله وبحمده، سبحان الله العظيم',
      'fav': "",
      'after': "",
      'icon': "",
      'totalCount': 0,
      'currentCount': 0,
      "fadl": ''
    });
    db.insert('azkar', zekr.toMap());

    ///
    ///
    ///
    ///////////////////
    ///
    ///
    ///
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': 'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ',
      'content':
          'اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
      'after': "",
      'fav': "0",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl":
          'من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
      'content':
          'قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl":
          'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
      'content':
          'قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
      'content':
          'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());

    db.insert('azkar', zekr.toMap());

    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl":
          'من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl":
          'من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك، وَمَلَائِكَتَكَ، وَجَمـيعَ خَلْـقِك، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 4,
      "fadl": 'من قالها أعتقه الله من النار.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": 'من قالها حين يصبح أدى شكر يومه.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 7,
      "fadl": 'من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": 'لم يضره من الله شيء.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه، وَرِضـا نَفْسِـه، وَزِنَـةَ عَـرْشِـه، وَمِـدادَ كَلِمـاتِـه.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر، وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي، وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم، فَـتْحَهُ، وَنَصْـرَهُ، وَنـورَهُ وَبَـرَكَتَـهُ، وَهُـداهُ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content': 'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 10,
      "fadl": 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'يَا رَبِّ، لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ, وَلِعَظِيمِ سُلْطَانِكَ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": 'ذكر طيب.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content':
          'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 100,
      "fadl":
          'كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content': 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 100,
      "fadl":
          'حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الصباح",
      'pre': '',
      'content': 'أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 100,
      "fadl":
          'مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': 'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ',
      'content':
          'اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl":
          'من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': 'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ',
      'content':
          'آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة 285 - 286].',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": 'من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
      'content':
          'قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl":
          'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
      'content':
          'قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl":
          'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
      'content':
          'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl":
          'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl":
          'من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl":
          'من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك، وَمَلَائِكَتَكَ، وَجَمـيعَ خَلْـقِك، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 4,
      "fadl": 'من قالها أعتقه الله من النار.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": 'من قالها حين يمسى أدى شكر يومه.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 7,
      "fadl": 'من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": 'لم يضره من الله شيء.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه، وَرِضـا نَفْسِـه، وَزِنَـةَ عَـرْشِـه، وَمِـدادَ كَلِمـاتِـه.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر، وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي، وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content': 'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 10,
      "fadl": 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 3,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 100,
      "fadl":
          'كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content':
          'اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": 'ذكر طيب.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار المساء",
      'pre': '',
      'content': 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ.',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 100,
      "fadl":
          'حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "الاستيقاظ من النوم",
      'pre': '',
      'content': 'الحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشور',
      'fav': "",
      'after': "رواه البخاري",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "الاستيقاظ من النوم",
      'pre': '',
      'content':
          'الحمد لله الذي ردَّ علي رُوحي، وعافاني في جسدي، وأَذِن لي بذِكره',
      'fav': "",
      'after': "رواه الترمذي",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار النوم",
      'pre': '',
      'content': 'بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا',
      'fav': "",
      'after': "رواه البخاري برقم (6324). من حديث حذيفة رضي الله عنه",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار النوم",
      'pre': '',
      'content':
          'بِاسْمِكَ رَبِّ وَضَعْتُ جَنْبِي وَبِكَ أَرْفَعُهُ إِنْ أَمْسَكْتَ نَفْسي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ',
      'fav': "",
      'after':
          "رواه البخاري برقم (6302)، ومسلم برقم (2714). من حديث أبي هريرة رضي الله عنه.",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار النوم",
      'pre': '',
      'content': 'اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ',
      'fav': "",
      'after': "رواه أحمد برقم (18660)، وصححه الألباني (صحيح الجامع 2/ 869).",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار النوم",
      'pre': '',
      'content':
          'اللَّهُمَّ إِنِّي أَسْلَمْتُ وَجْهِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ',
      'fav': "",
      'after': "رواه البخاري برقم (247)، ومسلم برقم (2710).",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl":
          'وَاجْعَلْهُنَّ مِنْ آخِرِ كَلاَمِكَ، فَإِنْ مُتَّ مِنْ لَيْلَتِكَ، مُتَّ وَأَنْتَ عَلَى الْفِطْرَةِ',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار النوم",
      'pre': '',
      'content': 'سبحان الله',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 33,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار النوم",
      'pre': '',
      'content': 'الحمد لله',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 33,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار النوم",
      'pre': '',
      'content': 'الله أكبر',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 33,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "لبس الثوب",
      'pre': '',
      'content':
          'اللهم إني أسألك من خيره وخير ما هو له، وأعوذ بك من شره وشرِّ ما هو له',
      'fav': "",
      'after': "رواه أبو داوود",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "دخور الخلاء",
      'pre': '',
      'content': 'بسم الله',
      'fav': "",
      'after': "رواه الطبراني",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "دخور الخلاء",
      'pre': '',
      'content': 'اللهم إني أعوذ بك من الخُبث والخبائث',
      'fav': "",
      'after': "رواه البخاري",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "الخروج من الخلاء",
      'pre': '',
      'content': 'غفرانك',
      'fav': "",
      'after': "صحيح الترمذي",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "قبل الوضوء",
      'pre': '',
      'content': 'بسم الله',
      'fav': "",
      'after': "رواه أبو داوود",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "إذا فرغ من الوضوء",
      'pre': '',
      'content':
          'أشهد أنْ لا إله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله',
      'fav': "",
      'after': "رواه مسلم",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": 'من قالها، فُتِحت له أبواب الجنة الثمانية، يدخل من أيِّها شاء',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "إذا فرغ من الوضوء",
      'pre': '',
      'content':
          'سبحانك اللهم وبحمْدك، أشهد أنْ لا إله إلا أنت، أستغفرك اللهم وأتوب إليك',
      'fav': "",
      'after': "رواه النسائي",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl":
          'من توضَّأ فأسبَغ الوضوء، ثم قالها عند فراغه من وضوئه- خُتِم عليها بخاتم، فوُضِعت تحت العرش، فلم يُكسَر إلى يوم القيامة',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "الخروج من المنزل",
      'pre': '',
      'content': 'بسم الله، توكَّلت على الله، ولا حول ولا قوة إلا بالله',
      'fav': "",
      'after': "رواه أبو داوود",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "الخروج من المنزل",
      'pre': '',
      'content':
          'اللهم إني أعوذ بك أن أَضِلَّ، أو أُضَل، أو أَزِل، أو أُزَل، أو أَظْلِم، أو أُظْلَم، أو أجْهَل، أو يُجهل علي',
      'fav': "",
      'after': "رواه ابن ماجة",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "الدخول للمنزل",
      'pre': '',
      'content':
          'بسم الله وَلَجنا، وبسم الله خرجنا، وعلى الله ربنا توكَّلنا، ثم ليسلِّم على أهله',
      'fav': "",
      'after': "رواه أبو داوود",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "الخروج للصلاة",
      'pre': '',
      'content':
          'اللهم اجعل في قلبي نورًا، وفي لساني نورًا، واجعل في سمعي نورًا، واجعل في بصري نورًا، واجعل من خلفي نورًا، ومن أمامي نورًا، واجعل من فوقي نورًا، ومن تحتي نورًا، اللهم أعطني نورًا',
      'fav': "",
      'after': "رواه البخاري، ومسلم",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "عند دخول المسجد",
      'pre': '',
      'content':
          'أعوذ بالله العظيم، وبوجهه الكريم، وسلطانه القديم - من الشيطان الرجيم',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "عند دخول المسجد",
      'pre': '',
      'content': 'بسم الله، والصلاة والسلام على رسول الله"',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "عند دخول المسجد",
      'pre': '',
      'content': 'اللهم افتح لي أبواب رحمتك',
      'fav': "",
      'after': "رواه مسلم",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "عند الخروج من المسجد",
      'pre': '',
      'content': 'اللهم إني أسألك من فضلك',
      'fav': "",
      'after': "رواه مسلم",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الأذان",
      'pre': '',
      'content':
          'يقول مثل ما يقول المؤذن، إلا في حي على الصلاة وحي على الفلاح، فيقول: لا حول ولا قوة إلا بالله',
      'fav': "",
      'after': "رواه البخاري ومسلم",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الأذان",
      'pre': '',
      'content':
          'صلي على النبي -صلى الله عليه وسلم- بعد فراغه من إجابة المؤذِّن',
      'fav': "",
      'after': "رواه مسلم",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الأذان",
      'pre': '',
      'content':
          'اللهم رب هذه الدعوة التامة، والصلاة القائمة، آت محمدًا الوسيلة والفضيلة، وابعَثه مقامًا محمودًا الذي وعَدته',
      'fav': "",
      'after': "رواه البخاري",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار الأذان",
      'pre': '',
      'content': 'يدعو لنفسه بين الأذان والإقامة، فإن الدعاء حينئذ لا يُرد',
      'fav': "",
      'after': "رواه أبو داوود",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "دعاء الاستخارة",
      'pre': '',
      'content':
          ' عن جابر بن عبدالله قال: كان رسول الله -صلى الله عليه وسلم- يعلِّمنا الاستخارة في الأمور كما يعلِّمنا السورة من القرآن، يقول: ((إذا همَّ أحدكم بالأمر، فليركع ركعتين من غير الفريضة، ثم ليقل: اللهم إني أستخيرك بعلمك، وأستَقدرك بقدرتك، وأسألك من فضلك العظيم؛ فإنك تَقدِر ولا أقدر، وتعلم ولا أعلم وأنت علاَّم الغيوب، اللهم إن كنت تعلم أن هذا الأمر خير لي في ديني ومعاشي وعاقبة أمري - أو قال: في عاجل أمري وآجله - فاقْدره لي ويسِّره لي، ثم بارِك لي فيه، وإن كنت تعلم أن هذا الأمر شرٌّ لي في ديني ومعاشي وعاقبة أمري - أو قال: في عاجل أمري وآجله - فاصرِفه عني واصرفني عنه، واقْدر لي الخير حيث كان، ثم أرضني به))، قال: "ويُسمي حاجته"',
      'fav': "",
      'after': "رواه البخاري.",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "رؤية هلال رمضان",
      'pre': '',
      'content':
          'اللهم أهِلَّه علينا باليُمن والإيمان، والسلامة والإسلام، ربي وربك الله',
      'fav': "",
      'after': "رواه الترمذي",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار قبل الأكل",
      'pre': '',
      'content': 'إذا أكلت، فسَمِّ الله، وكُل بيمينك، وكُلْ مما يَليك',
      'fav': "",
      'after': "رواه البخاري ومسلم",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار قبل الأكل",
      'pre': '',
      'content':
          'إذا أكل أحدكم طعامًا، فليقل: بسم الله، فإن نسِي في أوله، فليقل: بسم الله في أوله وآخره',
      'fav': "",
      'after': "رواه الترمذي",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار قبل الأكل",
      'pre': '',
      'content':
          'مَن أطعمه الله الطعام، فليقل: اللهم بارِك لنا فيه، وأطعمنا خيرًا منه، ومن سقاه الله لبنًا، فليقل اللهم بارِك لنا فيه وزِدنا منه',
      'fav': "",
      'after': "رواه الترمذي",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار بعد الأكل",
      'pre': '',
      'content': 'الحمد لله الذي أطعمني هذا، ورَزقنيه من غير حول مني ولا قوَّة',
      'fav': "",
      'after': "رواه أبو داوود",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "أذكار بعد الأكل",
      'pre': '',
      'content':
          'الحمد لله حمدًا كثيرًا طيبًا مباركًا فيه، غير مَكْفِيٍّ ولا مُودَّع، ولا مُستغنًى عنه ربَّنا',
      'fav': "",
      'after': "رواه البخاري",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "كفارة المجلس",
      'pre': '',
      'content':
          'سبحانك اللهم وبحمدك، أشهد أنْ لا إله إلا أنت، أستغفرك وأتوب إليك',
      'fav': "",
      'after': "رواه أبو داوود",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "دعاء الركوب",
      'pre': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
      'content':
          'سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ ',
      'fav': "",
      'after': "الزخرف (13-14)",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "دعاء الركوب",
      'pre': '',
      'content':
          'الحمد لله، الحمد لله، الحمد لله، الله أكبر، الله أكبر، الله أكبر، سبحانك اللهم إني ظلَمت نفسي فاغفر لي؛ فإنه لا يغفر الذنوب إلا أنت',
      'fav': "",
      'after': "رواه أبو داوود",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "دعاء السفر",
      'pre': 'الله أكبر، الله أكبر، الله أكبر',
      'content':
          'سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ ',
      'fav': "",
      'after': "الزخرف (13-14)",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "دعاء السفر",
      'pre': '',
      'content':
          'اللهمَّ إنَّا نسألك في سفرنا هذا البر والتقوى، ومن العمل ما ترضى، اللهم هوِّن علينا سفرنا هذا، واطْوِ عنَّا بُعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعثاء السفر، وكآبة المنظر، وسوء المُنقلَب في المال والأهل"، وإذا رجع قالهنَّ وزاد فيهنَّ: "آيبون، تائبون، عابدون، لربنا حامدون',
      'fav': "",
      'after': "رواه مسلم",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "دعاء الريح",
      'pre': '',
      'content':
          'اللهم إني أسألك خيرَها، وخير ما فيها، وخير ما أُرسلت به، وأعوذ بك من شرِّها، وشرِّ ما فيها، وشرِّ ما أُرسلت به',
      'fav': "",
      'after': "رواه البخاري ومسلم",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "دعاء نزول المطر",
      'pre': '',
      'content': 'اللهم صيِّبًا نافعًا',
      'fav': "",
      'after': "رواه البخاري",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "الدعاء بعد نزول المطر",
      'pre': '',
      'content': 'مُطِرنا بفضل الله ورحمته',
      'fav': "",
      'after': "رواه البخاري ومسلم",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "الدعاء لطرد الشيطان ووساوسه",
      'pre': '',
      'content': 'أعوذ بالله من الشيطان الرجيم',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "الدعاء لطرد الشيطان ووساوسه",
      'pre': '',
      'content': 'الآذان',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());
    zekr = Azkar({
      'category': "الدعاء لطرد الشيطان ووساوسه",
      'pre': '',
      'content': 'قراءة سورة البقرة',
      'fav': "",
      'after': "",
      'icon': "praying.svg",
      'totalCount': 1,
      "fadl": '',
    });
    db.insert('azkar', zekr.toMap());

    ////////////////

    ////////////////
  }

  Future<int> createCourse(Azkar a) async {
    Database db = await createDatabase();
    //db.rawInsert('insert into courses')
    print(a.toMap());
    print("Hello");
    return db.insert('azkar', a.toMap());
  }

  Future<List> allCourses(mycategory) async {
    Database db = await createDatabase();

    var x =
        db.rawQuery('SELECT * FROM azkar WHERE category=?', ['$mycategory']);

    return x;
    //return db.query('azkar');
  }

  Future<List> searchcontent(contents) async {
    Database db = await createDatabase();

    var x =
        db.rawQuery("SELECT * FROM azkar WHERE category LIKE '%$contents%'");
    // var x =
    //     db.rawQuery('SELECT * FROM azkar WHERE category=?', ['أذكار الصباح']);
    // var x =
    //     db.query("azkar", where: "content LIKE ?", whereArgs: ['%$content']);
    print(x);
    return x;
    //return db.query('azkar');
  }

  Future<List> allcategory() async {
    Database db = await createDatabase();
    return (db.rawQuery("SELECT DISTINCT category FROM azkar"));
  }

  Future<int> deleteCourse(int id) async {
    Database db = await createDatabase();
    return db.delete('azkar', where: 'id = ?', whereArgs: [id]);
  }

  Future<int> updateZekr(Azkar zekr) async {
    Database db = await createDatabase();
    // return db.update('azkar', where: 'id = ?', whereArgs: [id]);
    return await db.update(
      'azkar',
      zekr.toMap(),
      // Ensure that the Dog has a matching id.
      where: "id = ?",
      // Pass the Dog's id as a whereArg to prevent SQL injection.
      whereArgs: [zekr.id],
    );
  }

  Future<List> allsebhazekr() async {
    Database db = await createDatabase();
    String _searchword = "السبحه";
    return (db.rawQuery("SELECT * FROM azkar WHERE category= 'السبحه' "));
  }

  Future<List> updatesebha(String zekrcontent) async {
    Database db = await createDatabase();
    String _categ = '"السبحه"';

    var x = db.rawQuery(
        'SELECT * FROM azkar WHERE category=$_categ and content=?',
        ['$zekrcontent']);

    return x;
    // return db.update('azkar', where: 'id = ?', whereArgs: [id]);
    // return await db.update(
    //   'azkar',
    //   x,
    //   // Ensure that the Dog has a matching id.
    //   where: "id = ?",
    //   // Pass the Dog's id as a whereArg to prevent SQL injection.
    //   whereArgs: [zekr.id],
    // );
  }
}
